I am seeing issues like @motwanideepika-ee and @chaos-generator

Terraform 0.12.28
Terraform AWS Provider: 2.69.0

```
# aws_db_parameter_group.parameters[0] must be replaced
-/+ resource "aws_db_parameter_group" "parameters" {
      ~ arn         = "redacted" -> (known after apply)
        description = "Clone of default parameter group for oracle-se2 12"
        family      = "oracle-se2-12.2"
      ~ id          = "redacted" -> (known after apply)
      ~ name        = "redacted" -> (known after apply)
        name_prefix = "redacted"
        tags        = {
           redacted
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "cursor_sharing"
          + value        = "FORCE"
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "cursor_sharing" -> null
          - value        = "force" -> null
        }
        parameter {
            apply_method = "immediate"
            name         = "db_cache_size"
            value        = "0"
        }
        parameter {
            apply_method = "immediate"
            name         = "large_pool_size"
            value        = "0"
        }
        parameter {
            apply_method = "immediate"
            name         = "memory_target"
            value        = "0"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "nls_length_semantics"
          + value        = "CHAR"
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "nls_length_semantics" -> null
          - value        = "char" -> null
        }
        parameter {
            apply_method = "immediate"
            name         = "open_cursors"
            value        = "1000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "pga_aggregate_target"
          + value        = "{DBInstanceClassMemory*1/8}"
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "pga_aggregate_target" -> null
          - value        = "{dbinstanceclassmemory*1/8}" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "sga_target"
          + value        = "{DBInstanceClassMemory*3/4}"
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "sga_target" -> null
          - value        = "{dbinstanceclassmemory*3/4}" -> null
        }
        parameter {
            apply_method = "immediate"
            name         = "shared_pool_size"
            value        = "0"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "workarea_size_policy"
          + value        = "AUTO"
        }
      - parameter {
          - apply_method = "immediate" -> null
          - name         = "workarea_size_policy" -> null
          - value        = "auto" -> null
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "audit_trail"
          + value        = "DB"
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "audit_trail" -> null
          - value        = "db" -> null
        }
        parameter {
            apply_method = "pending-reboot"
            name         = "memory_max_target"
            value        = "0"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "sga_max_size"
          + value        = "{DBInstanceClassMemory*3/4}"
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "sga_max_size" -> null
          - value        = "{dbinstanceclassmemory*3/4}" -> null
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "use_large_pages"
          + value        = "ONLY"
        }
      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "use_large_pages" -> null
          - value        = "only" -> null
        }
    }
```